Revit 2027 API
IntersectionResult.EdgeParameter Property
Parameter of a point on the edge closest to the point of intersection.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public double EdgeParameter { get; }
Public ReadOnly Property EdgeParameter As Double
	Get
public:
property double EdgeParameter {
	double get ();
}
member EdgeParameter : float with get
Property Value
Double
Exceptions
Exception | Condition
InvalidOperationException |  Thrown in the getter when this property has not been set by the method providing the result.
See Also
Reference
IntersectionResult Class
Autodesk.Revit.DB Namespace